<?php
include("./API.php");
include("../tianyi.php");
tongji("tq");
$name = urlencode($_GET['msg']);//需要查询的地区名
$hh=$_GET["hh"]?:"\n";//换行符号(默认\n)
$data = file_get_contents("compress.zlib://http://wthrcdn.etouch.cn/weather_mini?city=".$name."");
preg_match_all("/date\":\"(.*?)\"(.*?)high\":\"(.*?)\"(.*?)fx\":\"(.*?)\"(.*?)low\":\"(.*?)\"(.*?)fl\":\"(.*?)\"(.*?)type\":\"(.*?)\"(.*?)city\":\"(.*?)\"(.*?)date\":\"(.*?)\"(.*?)high\":\"(.*?)\"(.*?)fengli\":\"(.*?)\"(.*?)low\":\"(.*?)\"(.*?)fengxiang\":\"(.*?)\"(.*?)type\":\"(.*?)\"(.*?)date\":\"(.*?)\"(.*?)high\":\"(.*?)\"(.*?)fengli\":\"(.*?)\"(.*?)low\":\"(.*?)\"(.*?)fengxiang\":\"(.*?)\"(.*?)type\":\"(.*?)\"(.*?)date\":\"(.*?)\"(.*?)high\":\"(.*?)\"(.*?)fengli\":\"(.*?)\"(.*?)low\":\"(.*?)\"(.*?)fengxiang\":\"(.*?)\"(.*?)type\":\"(.*?)\"(.*?)ganmao\":\"(.*?)\"/",$data,$c);
$q = $c[13][0];//地区
$w = $c[15][0];//第一天
$e = $c[17][0];//高温
$r = $c[21][0];//低温
$t = $c[23][0];//风度
$y = $c[25][0];//天气状态
$u = $c[27][0];//第二天
$i = $c[29][0];//高温
$o = $c[33][0];//低温
$p = $c[35][0];//风度
$a = $c[37][0];//天气状态
$s = $c[39][0];//第三天
$d = $c[41][0];//高温
$f = $c[45][0];//低温
$g = $c[47][0];//风度
$h = $c[49][0];//天气状态
echo "".$ming."API天气『三天版』".$hh."";
echo "━━━━━━━━━".$hh."";
echo "天气：$q".$hh."".$hh."";
echo "$w".$hh."";
echo "$e  $r   $t   $y".$hh."".$hh."";
echo "$u".$hh."";
echo "$i  $o  $p  $a".$hh."".$hh."";
echo "$s".$hh."";
echo "$d  $f  $g  $h".$hh."";
echo "━━━━━━━━━".$hh."";
echo "Tips:".$ming."API技术支持";
?>